# #Вывести на экран все числа от 50 до 150 включительно с помощью цикла while
# i = 50
# while i <= 150:
#     print(i)
#     i = i + 10
# print('END')
# # Вывести на экран при помощи цикла while следующий ряд чисел: 13, 20, 27 ...., 349.
# a = 13
# while a <= 349:
#     print(a)
#     a = a + 7
# print('END')
# #Напишите программу, которая при помощи цикла while сделает обратный отсчет от 15 до 0 (включительно)
# # и затем выведет "Поехали!" в самом конце.
b = 15
while b > 0:
    print(b)
    b = b - 1
print('ПОЕХАЛИ!')