#словарь
d = {"name":'Игорь',
"mid_name": 'Михайлович',
"bal": 522
     }
# через переменные
name = 'Игорь'
mid_name = 'Михайлович'
bal = 522
a = [
    ['Игорь', 'Михайлович', 1253],
    ['Татьяна', 'Викторовна', 56.32],
    ['Олег', 'Иванович', 5263.56],
    ['Ирина', 'Александровна', 625.23],
]


#ОБЪЯВЛЕНИЕ ФУНКЦИИ
def fu(x):
    return x**2
#--------------------------------------------------
# Вывод в тексте через f строку -- переменных
text = f"""Дорогой {name.upper()} {mid_name.upper()} Ваш баланс составляет {fu(9)} руб."""
# Вывод в тексте через f строку -- словаря
text2 = f"""Дорогой {d['name']} {d['mid_name']} Ваш баланс составляет {d['bal']} руб."""
text3 = f"""Дорогой {d['name']} {d['mid_name']} Ваш баланс составляет {d.get('bal')} руб."""

# Вывод в тексте через f строку -- вложенные списки

print('------------------------------------------------------------')
print(text)
print('------------------------------------------------------------')
print(text2)
print('------------------------------------------------------------')
print(text3)
print('------------------------------------------------------------')
