
gender = {
    'f': 'Дорогая',
    'm': 'Дорогой'
}
# Вложенные списки
a = [
    ['Игорь', 'Михайлович', 1253, 'm'],
    ['Татьяна', 'Викторовна', 56.32, 'f'],
    ['Олег', 'Иванович', 5263.56, 'm'],
    ['Ирина', 'Александровна', 625.23, 'f'],
]
print('------------------------------------------------------------')
for name, mid_name, bal, g in a:
    text = f"""{gender[g]} {name} {mid_name} Ваш баланс составляет {bal} руб."""
    print(text)
    print('------------------------------------------------------------')

