print('Варианты записи физических и логических строк')
print('''i=5 # Физическая строка на ней расположена логическая строка
print(i) # Физическая строка на ней расположена логическая строка''')
i=5 # Физическая строка
print(i) # Физическая строка
print('''a=45;print(a) # Физическая строка  на которой записаны две логические строки''')
a=45;print(a) # Физическая строка  на которой записаны две логические строки
print('Тоже самое ' '''Физическая строка  на которой записаны две логические строки b=33;print(b);''')
b=33;print(b);